//옛날에 이상한 상황에서 사람들은 한 자리 소수(2, 3, 5 또는 7)로 나눌 수있는 숫자를 못생긴 숫자라고 불렀습니다.
//따라서 14는 못 생겼지 만 13은 괜찮습니다. 39는 못 생겼지 만 121은 그렇지 않습니다. 0은 추한 것입니다.또한 음수도 추악 할 수 있습니다.
//- 14 및 - 39는 이러한 숫자의 예입니다.

//어느 날 여가 시간에 다음과 같은 일련의 숫자를 응시하고 있습니다.
//12345

//숫자 사이에 더하기 또는 빼기 기호를 삽입 할 수 있다면 얼마나 많은 가능성이 있는지에 대해 즐거워합니다. 예를 들어
//1 + 234 - 5 + 6 = 236

//추악합니다. 또는
//123 + 4 - 56 = 71

//추악하지 않습니다.
//숫자로 연주 할 수있는 다양한 방법의 수를 세는 것은 쉽습니다.
//인접한 두 숫자 사이에 더하기 기호, 빼기 기호 또는 아무것도 넣지 않을 수 있습니다.
//따라서 D 자리로 시작하면 3D - 1 표현을 만들 수 있습니다.
//숫자 앞에 0을 붙여도 괜찮습니다.
//문자열이 "01023"이면 "01023", "0 + 1-02 + 3"및 "01-023"이 유효한 표현식입니다.
//당신의 임무는 간단합니다.
//3D - 1 표현들 중에서 얼마나 많은 것이 못생긴 숫자로 평가되는지 세십시오.

#include <iostream>

using namespace std;

void Input()
{

}

void Solution() 
{
}

void Solve() 
{
	Input();
	Solution();
}

int main() 
{
	ios::sync_with_stdio(false);
	cin.tie(NULL);
	cout.tie(NULL);
	Solve();

	return 0;
}